{
  "mathematicians": [
    {
        "name": "Albert Einstein",
        "famous_for": "E = m*c^2",
        "history": "Albert Einstein excelled in mathematics early in his childhood. He liked to study math on his own. He was once quoted as saying, “I never failed in mathematics… before I was fifteen I had mastered differential integral calculus.”"
    },
    {
        "name": "Isaac Newton",
        "famous_for": "Mathematical Principles of Natural Philosophy",
        "history": "The book of Sir Isaac Newton, Mathematical Principles of Natural Philosophy, became the catalyst to understanding mechanics. He is also the person credited for the development of the binomial theorem."
    },
    {
        "name": "Leonardo Pisano Bigollo",
        "famous_for": "Fibonacci sequence",
        "history": "Heralded as “the most talented western mathematician of the middle ages,” Leonardo Pisano Bigollo is better known as Fibonacci. He introduced the Arabic-Hindu number system to the western world. In his book, Liber Abaci (Book of Calculation), he included a sequence of numbers that are known today as “Fibonacci numbers.”"
    },
    {
      "name": "Thales",
      "famous_for": "Father of science & Thales’ theorem",
      "history": "Thales used principles of mathematics, specifically geometry, to solve everyday problems. He is considered as the “first true mathematician”. His deductive reasoning principles are applied in geometry that is a product of “Thales’ Theorem.”"
    },
    {
      "name": "Pythagoras",
      "famous_for": "Pythagorean theorem",
      "history": "Pythagoras is best known in mathematics for the Pythagorean Theorem."
    },
    {
      "name": "René Descartes",
      "famous_for": "Cartesian coordinate system",
      "history": "The “Cartesian coordinate system” in mathematics is named after Rene Descartes. As a mathematician, he is seen as the father of analytical geometry in addition to explaining “infinitesimal calculus and analysis.”"
    },
    {
      "name": "Archmiedes",
      "famous_for": "Greatest mathematician of antiquity",
      "history": "Archimedes provided principles and methods used in mathematics today. He provided the exact numerical value of pi, developed a system for large numbers to be expressed, and the method of exhaustion."
    },
    {
      "name": "John Forbes Nash, Jr.",
      "famous_for": "Nash embedding theorem",
      "history": "The work of American mathematician John Nash includes studies in differential geometry, game theory, and partial differential equations. He is best known for the Nash embedding theorem. His work in algebraic geometry is also seen as milestone in mathematics."
    },
    {
      "name": "Blaise Pascal",
      "famous_for": "Pascal’s Triangle",
      "history": "Pascal is recognized for two mathematical areas of study, projective geometry and probability theory. He describes in his paper, Treatise on the Arithmetical Triangle, an easy to understand table of “binomial coefficients” known as Pascal’s Triangle"
    },
    {
      "name": "Euclid",
      "famous_for": "Father of geometry",
      "history": "The earliest known “math books” is one written by Greek mathematician Euclid, Elements is its title. It serve as a textbook to teach geometry and mathematics. His mathematical system is known as “Euclidean geometry.”"
    },
    {
      "name": "Aryabhata",
      "famous_for": "Writing Āryabhaṭīya and the Arya-siddhanta",
      "history": "Indian mathematician Aryabhatta’s contribution include his work on providing an approximate value to pi. He likewise touched on the concepts of sine, cosine, and the place-value system."
    },
    {
      "name": "Ptolemy",
      "famous_for": "Almagest",
      "history": "Ptolemy was a mathematician of the highest order. In his book Almagest, or The Mathematical Compilation, Ptolemy provides mathematical theories related to the solar system."
    },
    {
      "name": "Ada Lovelace",
      "famous_for": "Work on the Analytical Engine",
      "history": "English mathematician Ada Lovelace is recognized as the worlds first computer programmer. Her mathematical skills were evident at an early age. As part of her work, she produced a mathematical algorithm that would be later used in computers."
    },
    {
      "name": "Alan Turing",
      "famous_for": "Father of computer science",
      "history": "Turing’s fame as a mathematician can be attributed to his formulating of algorithms and computations for a computer, the Turing Machine. His mathematical background helped device techniques in code breaking, specifically in world war 2. In 1948 Turing became interested in mathematical biology."
    },
    {
      "name": "Srinivasa Ramanujan",
      "famous_for": "Landau-Ramanujan constant",
      "history": "Ramanujan was a genius in mathematics. He helped expand mathematical theory, particularly in continued fractions, infinite series, mathematical analysis, and number theory. He conducted mathematical research in seclusion."
    },
    {
      "name": "Benjamin Banneker",
      "famous_for": "Calculating a solar eclipse",
      "history": "Benjamin Banneker was a self-taught mathematician. He used his mathematical skills to predict an eclipse and the seventeen-year cycle of locusts."
    },
    {
      "name": "Omar Khayyám",
      "famous_for": "Treatise on Demonstration of Problems of Algebra",
      "history": "Omar Khayyam wrote one of the most important books in mathematics, Treatise on Demonstration of Problems of Algebra from which most algebraic principles have been drawn from. In the area of geometry, Khayyam worked on the “theory of proportions.”"
    },
    {
      "name": "Eratosthenes",
      "famous_for": "Sieve of Eratosthenes",
      "history": "Eratosthenes provided the concept of a simple algorithm as a way to locate prime numbers. The Sieve of Eratosthenes that has been used to find prime numbers."
    },
    {
      "name": "John von Neumann",
      "famous_for": "Operator theory and quantum mechanics",
      "history": "The mathematical evaluation of self-replication by John von Neumann came before the DNA model was introduced. Other mathematical subjects he tackled include the “mathematical formulation of quantum mechanics”, “game theory,” mathematical statistics and mathematical economics. His contribution to the study of the “operator theory” is equally important."
    },
    {
      "name": "Pierre de Fermat",
      "famous_for": "Fermat’s Last Theorem",
      "history": "As an amateur mathematician, de Fermat is given recognition for his work that has led to infinitesimal calculus. He applied the use of “adequality” in explaining his mathematical constructs. De Fermat’s also contributed to the math fields of analytic geometry, differential calculus, and number theory."
    },
    {
      "name": "John Napier",
      "famous_for": "Inventing “logarithms”",
      "history": "John Napier is responsible for manufacturing logarithms. It was also he who applied the everyday use of the decimal point in mathematics and arithmetic. Napier’s bones was an abacus created by John. The device was used mainly for multiplication problems."
    },
    {
      "name": "Gottfried Wilhelm Leibniz",
      "famous_for": "Infinitesimal calculus",
      "history": "The work of Leibniz on infinitesimal calculus was one completely separate from Isaac Newton. His mathematical notation continues to be in use. He also proposed the mathematical principle known as the Transcendental Law of Homogeneity. His refining of the binary system has become foundational in mathematics."
    },
    {
      "name": "Andrew Wiles",
      "famous_for": "Proving “Fermat’s Last Theorem”",
      "history": "Andrew Wiles was successful in proving “Fermat’s Last Theorem”. He also used the “Iwasawa theory” to identify elliptic curves using its complex multiplication system. Wiles, with a colleague, worked on rational numbers under the “Iwasawa theory”."
    },
    {
      "name": "David Hilbert",
      "famous_for": "Hilbert’s basis theorem",
      "history": "In cumulative algebra, the use of “Hilbert’s basis theory” has produced varying results. David Hilbert explored and improved on ideas such as “axiomatization of geometry” and the “invariant theory.” Functional analysis, a branch of mathematical analysis, is based on the formulation of “Hilbert’s spaces theory.”"
    },
    {
      "name": "Daniel Bernoulli",
      "famous_for": "Bernoulli principle",
      "history": "Hydrodynamica by Daniel Bernoulli was a book that touched on mathematical principles applied in other sciences."
    },
    {
      "name": "Luca Pacioli",
      "famous_for": "Father of accounting",
      "history": "Fifteenth century friar and mathematician Luca Pacioli developed an accounting or bookkeeping methods that are still in use today. Because of this, Pacioli is viewed by many as the “father of accounting.”"
    },
    {
      "name": "Georg Cantor",
      "famous_for": "Inventor of set theory",
      "history": "One of the basic theories in mathematics is the set theory, thanks to the work of Georg Cantor. He helped define the importance of the “one-to-one correspondence” principle as well as introduce cardinal and ordinal numbers."
    },
    {
      "name": "George Boole",
      "famous_for": "Boolean algebra",
      "history": "George Boole and his ideas on mathematics were in the field of algebraic logic and differential equations. He is the source of what is known as “Boolean logic” in algebra. This and other mathematical concepts are part of his bookThe Laws of Thought."
    },
    {
      "name": "Évariste Galois",
      "famous_for": "Theory of Equations",
      "history": "Galois worked on abstract algebra and the theory of equations. He also set forth a solution to the polynomial equation which is know as the “Galois theory.”"
    },
    {
      "name": "Sophie Germain",
      "famous_for": "Sophie Germain prime numbers",
      "history": "Sophie Germain worked extensively in the mathematical field of number theory and differential geometry. She helped lay possible solutions to “Ferrats Last Theorem.” Sophie’s work with number theory earned her recognition and having numbers named after her, “Sophie Germain prime.”"
    },
    {
      "name": "Emmy Noether",
      "famous_for": "Abstract algebra",
      "history": "Emmy Noether and her work on abstract algebra makes her one of the most important mathematicians of her time. She introduced theories on algebraic variants and number fields. In Noether’s paper, Theory of Ideals in Ring Domains, she presented her ideas on the “commutative ring”, an abstract algebra sub area."
    },
    {
      "name": "Edward Witten",
      "famous_for": "String theory",
      "history": "Edward Witten specialized in the field of mathematical physics. He brought together math concepts and basic physics."
    }
]
}